In [1]:
%matplotlib inline

import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

sns.set_style("whitegrid")

# The first data set
## imdb.title.principals

In [2]:
title_principals = pd.read_csv("data/imdb.title.principals.csv.gz")
title_principals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [3]:
title_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
tconst        1028186 non-null object
ordering      1028186 non-null int64
nconst        1028186 non-null object
category      1028186 non-null object
job           177684 non-null object
characters    393360 non-null object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [4]:
print(title_principals.job.isna().sum() / len(title_principals) * 100)
print(title_principals.characters.isna().sum() / len(title_principals) * 100)

82.71869097614633
61.74233066779746

We don't need the job and characters columns.

In [5]:
title_principals.drop(columns=["job", "characters"], inplace=True)
title_principals.head()

      tconst  ordering     nconst  category
0  tt0111414         1  nm0246005     actor
1  tt0111414         2  nm0398271  director
2  tt0111414         3  nm3739909  producer
3  tt0323808        10  nm0059247    editor
4  tt0323808         1  nm3579312   actress

# The second data set
## imdb.title.ratings

In [6]:
title_ratings = pd.read_csv("data/imdb.title.ratings.csv.gz")
title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [7]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

# Merging the two data frames

In [8]:
df = title_principals.merge(title_ratings, on="tconst", how="inner")
df.head()

      tconst  ordering     nconst category  averagerating  numvotes
0  tt0323808        10  nm0059247   editor            3.9      2328
1  tt0323808         1  nm3579312  actress            3.9      2328
2  tt0323808         2  nm2694680    actor            3.9      2328
3  tt0323808         3  nm0574615    actor            3.9      2328
4  tt0323808         4  nm0502652  actress            3.9      2328

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 629755 entries, 0 to 629754
Data columns (total 6 columns):
tconst           629755 non-null object
ordering         629755 non-null int64
nconst           629755 non-null object
category         629755 non-null object
averagerating    629755 non-null float64
numvotes         629755 non-null int64
dtypes: float64(1), int64(2), object(3)
memory usage: 33.6+ MB

In [10]:
df[df.duplicated()]

Empty DataFrame
Columns: [tconst, ordering, nconst, category, averagerating, numvotes]
Index: []

# The third data set
## imdb.name.basics

In [11]:
name_basics = pd.read_csv("data/imdb.name.basics.csv.gz")
name_basics.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [12]:
name_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
nconst                606648 non-null object
primary_name          606648 non-null object
birth_year            82736 non-null float64
death_year            6783 non-null float64
primary_profession    555308 non-null object
known_for_titles      576444 non-null object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

In [13]:
name_basics.death_year.isna().sum() / len(name_basics) * 100

98.88188867349764

In [14]:
name_basics.death_year.isna().sum()

599865

We don't want the people that have already passed. Can't hire them...

In [15]:
name_basics = name_basics[name_basics.death_year.isna()]
len(name_basics)

599865

We just need the names.

In [16]:
name_basics.drop(columns=["birth_year", "death_year", "primary_profession", "known_for_titles"], inplace=True)
name_basics.head()

      nconst       primary_name
0  nm0061671  Mary Ellen Bauder
1  nm0061865       Joseph Bauer
2  nm0062070         Bruce Baum
3  nm0062195       Axel Baumann
4  nm0062798        Pete Baxter

# More merging

In [17]:
df = df.merge(name_basics, on="nconst", how="inner")
df.head()

,tconst,ordering,nconst,category,averagerating,numvotes,primary_name
0,tt0323808,10,nm0059247,editor,3.9,2328,Sean Barton
1,tt2081348,10,nm0059247,editor,4.1,48,Sean Barton
2,tt1414378,10,nm0059247,editor,6.5,3460,Sean Barton
3,tt2712990,10,nm0059247,editor,5.6,329,Sean Barton
4,tt2395207,9,nm0059247,editor,5.5,22,Sean Barton

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 621366 entries, 0 to 621365
Data columns (total 7 columns):
tconst           621366 non-null object
ordering         621366 non-null int64
nconst           621366 non-null object
category         621366 non-null object
averagerating    621366 non-null float64
numvotes         621366 non-null int64
primary_name     621366 non-null object
dtypes: float64(1), int64(2), object(4)
memory usage: 37.9+ MB

In [19]:
df[df.duplicated()]

Empty DataFrame
Columns: [tconst, ordering, nconst, category, averagerating, numvotes, primary_name]
Index: []

# Whom should we hire?

We want to hire those who can potentially help us make movies that have good ratings.

Let's have high standard! A good movie should have an average rating of at least 8.

In [20]:
df_good_rating = df[df.averagerating >= 8]
df_good_rating.head()

,tconst,ordering,nconst,category,averagerating,numvotes,primary_name
15,tt2379402,8,nm0676104,cinematographer,8.1,10,Jan Pester
39,tt7769118,3,nm0532721,actor,9.0,22,Luis Machín
61,tt4551544,5,nm1145057,director,8.1,14,Alejandro Chomski
62,tt6622064,1,nm1145057,self,8.5,8,Alejandro Chomski
73,tt2139847,1,nm0036109,self,8.0,9,Lucie Arnaz

In [21]:
len(df_good_rating)

69665

We will only focus on actors, actresses, directors, and writers.

In [22]:
df_good_rating_cat = df_good_rating.groupby("category")

In [23]:
good_actors = list(df_good_rating_cat.get_group("actor").primary_name)
print(len(set(good_actors)))
good_actors = list(set(good_actors))
print(len(good_actors))

13397
13397

In [24]:
good_actresses = list(df_good_rating_cat.get_group("actress").primary_name)
print(len(set(good_actresses)))
good_actresses = list(set(good_actresses))
print(len(good_actresses))

6690
6690

In [25]:
good_directors = list(df_good_rating_cat.get_group("director").primary_name)
print(len(set(good_directors)))
good_directors = list(set(good_directors))
print(len(good_directors))

8967
8967

In [26]:
good_writers = list(df_good_rating_cat.get_group("writer").primary_name)
print(len(set(good_writers)))
good_writers = list(set(good_writers))
print(len(good_writers))

3609
3609

# Whom should we hire? For real this time!

At this point, we have ourselves a list of good actors, a list of good actresses, a list of good directors, and a list of good writers. However, are they really good? Or are they just lucky?

Let us only consider hiring those who are consistenly sucessfull.

More than 5 projects per portfolio is decent?!

In [27]:
df_people = df.groupby("primary_name")

In [28]:
good_actors_new = []
for person in good_actors:
    if len(df_people.get_group(person)) > 5 and df_people.get_group(person).averagerating.mean() >= 8:
        good_actors_new.append(person)
print(len(good_actors_new))
len(set(good_actors_new))

18

18

In [29]:
good_actresses_new = []
for person in good_actresses:
    if len(df_people.get_group(person)) > 5 and df_people.get_group(person).averagerating.mean() >= 8:
        good_actresses_new.append(person)
print(len(good_actresses_new))
len(set(good_actresses_new))

7

7

In [30]:
good_directors_new = []
for person in good_directors:
    if len(df_people.get_group(person)) > 5 and df_people.get_group(person).averagerating.mean() >= 8:
        good_directors_new.append(person)
print(len(good_directors_new))
len(set(good_directors_new))

28

28

In [31]:
good_writers_new = []
for person in good_writers:
    if len(df_people.get_group(person)) > 5 and df_people.get_group(person).averagerating.mean() >= 8:
        good_writers_new.append(person)
print(len(good_writers_new))
len(set(good_writers_new))

7

7

# Who are the winners?

In [32]:
df_hire = pd.DataFrame([good_actors_new, good_actresses_new, good_directors_new, good_writers_new])

In [33]:
df_hire = df_hire.T

In [34]:
df_hire.columns = ["Actors", "Actresses", "Directors", "Writers"]

In [35]:
df_hire

,Actors,Actresses,Directors,Writers
0,Timothy J. Cox,Lauren Lopez,Josh Lowell,Nick Rosen
1,Joshua Bell,Lelani Mitchem,Tim Van Someren,Alvaro Calderón
2,Ian Cranston,Sargun Mehta,Nick Rosen,Matt Lang
3,Kalyan Chatterjee,Sylvia Earle,Joshua Bell,David Anghel
4,Michael Henry,Jayani Senanayake,Nick Wickham,Eric Frith
5,Thumindu Dodantenne,CC King,Carlos Nader,Darren Wilson
6,Om Bhutkar,Susan Brown,Thom Zimny,Brian Holden
7,Pauli Janhunen Calderón,None,Ian Cranston,None
8,Alvaro Calderón,None,Mat Hames,None
9,Alex Honnold,None,Christopher Nolan,None
10,David Anghel,None,Ali Shifau,None
11,Michael Fleming,None,Michael Henry,None
12,Steve Ravic,None,Andrew Swant,None
13,Darren Wilson,None,Pauli Janhunen Calderón,None
14,Emilio Janhunen Calderón,None,Branko Istvancic,None
15,Sserunya Ernest,None,Nick Lang,None
16,Thom Keller,None,Dawn Gifford Engle,None
17,Elton John,None,Tom Logan,None
18,None,None,Peter Mortimer,None
19,None,None,Steve Ravic,None
20,None,None,Darren Wilson,None
21,None,None,Brian Holden,None
22,None,None,Christopher Kenneally,None
23,None,None,Dick Carruthers,None
24,None,None,Robin Lough,None
25,None,None,Ross MacGibbon,None
26,None,None,Joe L. Roberts,None
27,None,None,Nabwana I.G.G.,None